第2讲-算法入门.ppt
第5讲-堆排序.ppt
第7讲-线性时间排序.ppt
第9讲-动态规划.ppt（装配线、矩阵链乘,最长公共子序列、最大子断和）
第10讲-贪心算法.ppt
				调度问题
				活动选择 (Chap 16.1)
				最小化系统时间
				带截止期限的调度 (Chap 16.5)
				图论算法
				最小生成树 (Chap 23)
				Dijkstra’s (最短路径) 算法 (Chap 24.3)
				其它
				霍夫曼编码 (Chap 16.3)
				图的着色
				旅行商问题 (Chap 35.2)
				集合覆盖 (Chap 35.3)
				子集和数问题 (Chap 35.5)

第12讲-最短路径.ppt


1、
排序：
	插入排序：#
	归并排序：#
	希尔排序：
	快速排序：#
	冒泡排序：
	堆排序：#
	计数排序：#
	基数排序：#
	桶排序：
2、
查找：

3、
递归：
分治法：分、治、合(也许不要做任何工作)
	如：归并排序、快速排序

贪心：
动态：


4、
数组：(堆)
	堆————(大根堆，小根堆)建堆、堆排序、堆查找、堆删除、堆添加，堆顶元素
	堆虽然没有快排给力，但用途挺广：
								最大优先队列 的应用.
							    --在共享的计算机上调度作业
							        >>记录待调度的作业及其优先级
							    --堆排序相关操作
							        >>用于实现优先级队列
								最小优先队列 的应用.
								    --Dijkstra 最短路径算法
								    --Prim 最小生成树算法
								    --事件驱动的模拟
								        >>按照事件的预期发生时间定立其处理的优先级
								    --Huffman 编码
链表：
树：
图：